# Домашнее задание по теме: MySQL

## Подготовка

Установка `MySQL Community Server` + `MySQL Workbench`:

- [MySQL Community Server](https://dev.mysql.com/downloads/mysql/)
    
- [MySQL Workbench](https://dev.mysql.com/downloads/workbench/)

In [4]:
# ВНИМАНИЕ: необходимо удостовериться, что виртуальная среда выбрана правильно!

# для Linux
!which pip

# для Windows
!pip -V

"which" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

pip 20.3.3 from D:\Anaconda\lib\site-packages\pip (python 3.8)

In [1]:
# установка необходимых пакетов
!conda install SQLAlchemy pymysql -y

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

In [4]:
# импорт необходимых пакетов
import pandas as pd
from sqlalchemy import create_engine

import sqlalchemy
sqlalchemy.__version__

'1.3.23'

In [216]:
# данные для подключения к серверу MySQL
user='MY_LOGIN'
password='MY_PASS'
host='127.0.0.1'
port='3306'

In [217]:
# подключение к серверу MySQL (engine)
engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}")
engine

Engine(mysql+pymysql://root:***@127.0.0.1:3306)

## ERR Model

<img src="images/eer_model_hw.png"/>

## Создание БД

In [218]:
db_name='goods_db'

with engine.connect() as connection:
    connection.execute(f'DROP DATABASE IF EXISTS {db_name}')
    connection.execute(f'CREATE DATABASE {db_name}')
    connection.execute(f'USE {db_name}')

## Создание таблиц

In [187]:
# items
with engine.connect() as connection:
    connection.execute("""CREATE TABLE `goods_db`.`items` (
                         `id` INT NOT NULL AUTO_INCREMENT,
                          `name` VARCHAR(20) NULL,  
                          `type` ENUM('dry', 'wet') NULL,
                          `expiration_date` DATE NOT NULL,
                          PRIMARY KEY (`id`))""")

In [188]:
# categories
with engine.connect() as connection:
    connection.execute("""CREATE TABLE `goods_db`.`categories` (
                          `id` INT NOT NULL AUTO_INCREMENT,
                          `name` VARCHAR(50) NULL,
                           PRIMARY KEY (`id`))""")

In [189]:
# prices
with engine.connect() as connection:
    connection.execute("""CREATE TABLE `goods_db`.`prices` (
                          `items_id` INT NOT NULL,
                          `price` FLOAT NULL,
                          INDEX `items_id_ix` (`items_id` ASC) VISIBLE,
                          FOREIGN KEY (items_id)
                          REFERENCES `goods_db`.`items`(`id`) 
                          ON DELETE CASCADE
                          ON UPDATE CASCADE)""")

In [190]:
# items_categories
with engine.connect() as connection:
    connection.execute("""CREATE TABLE `goods_db`.`items_categories` (
                          `category_id` INT NOT NULL,
                          `item_id` INT NOT NULL,
                          INDEX `cat_ix_cat` (`category_id` ASC) VISIBLE,
                          INDEX `items_id_ix_cat` (`item_id` ASC) VISIBLE,                          
                          FOREIGN KEY (category_id)
                          REFERENCES `goods_db`.`categories`(`id`) 
                          ON DELETE CASCADE
                          ON UPDATE CASCADE,
                          FOREIGN KEY (item_id)
                          REFERENCES `goods_db`.`items`(`id`) 
                          ON DELETE CASCADE
                          ON UPDATE CASCADE)
                          """)

## Заполнение таблиц

(Самостоятельно придумать данные для заполнения, это не имеет значения. 5-15 значений в каждой таблице)

In [191]:
# items
with engine.connect() as connection:
    connection.execute("""INSERT INTO `goods_db`.`items` (name, type, expiration_date) VALUES 
                        ('Rifle_not_renamed', 'dry', CURRENT_TIMESTAMP), 
                        ('Knife', 'dry', CURRENT_TIMESTAMP), 
                        ('Rocket', 'dry', CURRENT_TIMESTAMP), 
                        ('Gun', 'dry', CURRENT_TIMESTAMP), 
                        ('Laser', 'dry', CURRENT_TIMESTAMP), 
                        ('Shotgun', 'wet', CURRENT_TIMESTAMP)""")

In [192]:
# categories
with engine.connect() as connection:
    connection.execute("""INSERT INTO `goods_db`.`categories` (name) VALUES 
                        ('One Hand Weapon'), 
                        ('Two Hand Weapon')""")

In [193]:
# prices
with engine.connect() as connection:
    connection.execute("""INSERT INTO `goods_db`.`prices` (items_id, price) VALUES 
                        (1, 100), 
                        (2, 10), 
                        (3, 300), 
                        (4, 350), 
                        (5, 400), 
                        (6, 500)""")

In [194]:
# items_categories
with engine.connect() as connection:
    connection.execute("""INSERT INTO `goods_db`.`items_categories` (item_id, category_id) VALUES 
                        (1, 2), 
                        (2, 1), 
                        (3, 2), 
                        (4, 1), 
                        (5, 1), 
                        (6, 2)""")

## Проверка заполнения таблиц

(Вывести данные, которые были записаны в таблицы)

In [195]:
# items
table_i = pd.read_sql_query("""SELECT * FROM `goods_db`.`items`""", engine)
table_i

   id               name type expiration_date
0   1  Rifle_not_renamed  dry      2021-02-11
1   2              Knife  dry      2021-02-11
2   3             Rocket  dry      2021-02-11
3   4                Gun  dry      2021-02-11
4   5              Laser  dry      2021-02-11
5   6            Shotgun  wet      2021-02-11

In [196]:
# categories
table_c = pd.read_sql_query("""SELECT * FROM `goods_db`.`categories`""", engine)
table_c

   id             name
0   1  One Hand Weapon
1   2  Two Hand Weapon

In [197]:
# prices
table_p = pd.read_sql_query("""SELECT * FROM `goods_db`.`prices`""", engine)
table_p

   items_id  price
0         1  100.0
1         2   10.0
2         3  300.0
3         4  350.0
4         5  400.0
5         6  500.0

In [198]:
# items_categories
table_ic = pd.read_sql_query("""SELECT * FROM `goods_db`.`items_categories`""", engine)
table_ic

   category_id  item_id
0            2        1
1            1        2
2            2        3
3            1        4
4            1        5
5            2        6

## Обновление данных

In [199]:
# изменить одно наименование (name) товара
with engine.connect() as connection:
    connection.execute("""UPDATE `goods_db`.`items` SET name='Rifle' WHERE id=1""")

In [200]:
# проверить, что наименование изменилось
table_i = pd.read_sql_query("""SELECT * FROM `goods_db`.`items` WHERE id=1""", engine)
table_i

   id   name type expiration_date
0   1  Rifle  dry      2021-02-11

## Удаление данных

In [201]:
# удалить один товар с условием
with engine.connect() as connection:
    connection.execute("""DELETE FROM `goods_db`.`items` WHERE name='Knife'""")

In [202]:
# проверить, что наименование товар был удален из таблицы items
table_i = pd.read_sql_query("""SELECT * FROM `goods_db`.`items` WHERE name='Knife'""", engine)
table_i

Empty DataFrame
Columns: [id, name, type, expiration_date]
Index: []

In [203]:
# проверить, что наименование товар был удален из таблицы items_categories
table_p = pd.read_sql_query("""SELECT 
                            items_cat.item_id
                            FROM `goods_db`.`items_categories` AS items_cat
                            INNER JOIN
                            `goods_db`.`items` AS items ON items_cat.item_id = items.id
                            AND
                            items.name = 'Knife'                            
                            """, engine)
table_p

Empty DataFrame
Columns: [item_id]
Index: []

In [204]:
# проверить, что наименование товар был удален из таблицы prices
table_p = pd.read_sql_query("""SELECT 
                            prices.items_id
                            FROM `goods_db`.`prices` AS prices
                            INNER JOIN
                            `goods_db`.`items` AS items ON prices.items_id = items.id
                            AND
                            items.name = 'Knife'                            
                            """, engine)
table_p

Empty DataFrame
Columns: [items_id]
Index: []

## ERR Model

<img src="images/eer_model_hw.png"/>

## Получение данных (с условиями)

In [205]:
n = 300 # выбрать n
# вывести все данные из таблицы prices, где price больше n
table_p = pd.read_sql_query("""SELECT * FROM `goods_db`.`prices` WHERE price > """ + str(n), engine)
table_p

   items_id  price
0         4  350.0
1         5  400.0
2         6  500.0

In [206]:
n = 300 # выбрать n
nid = 4 # выбрать nid
# вывести все данные из таблицы prices, где price больше n И item_id не равен nid
table_p = pd.read_sql_query("""SELECT * FROM `goods_db`.`prices` WHERE price > """+ str(n)+ """ AND items_id <> """ + str(nid), engine)
table_p

   items_id  price
0         5  400.0
1         6  500.0

In [207]:
first_syms = 'R' # выбрать символы (буква или несколько букв)
# вывести все данные из таблицы items, где name начинается с first_syms
table_i = pd.read_sql_query("""SELECT name, type FROM `goods_db`.`items` WHERE name LIKE '""" + str(first_syms) + """%%'""", engine)
table_i

     name type
0   Rifle  dry
1  Rocket  dry

In [208]:
last_sym = 'e' # выбрать символ (буква)
item_type = 'dry' # выбрать тип

# объединить (union) результаты запросов (повторения допускаются):
# name, type из items, где name заканчивается символом last_sym
# name, type из items, где type равен item_type
table_i = pd.read_sql_query("""SELECT name, type FROM `goods_db`.`items` WHERE name LIKE '%%""" + str(last_sym) + """'
                            UNION ALL
                            SELECT name, type FROM `goods_db`.`items` WHERE type = '""" +  str(item_type) + """'""", engine)
table_i

     name type
0   Rifle  dry
1   Rifle  dry
2  Rocket  dry
3     Gun  dry
4   Laser  dry

In [209]:
# вывести name, type из items и price из prices
# указывать только товары содержащие цены и не должно быть цен без товаров
table_i = pd.read_sql_query("""SELECT 
                                name
                                , type
                                , price 
                            FROM 
                                `goods_db`.`items` AS items
                            INNER JOIN
                                `goods_db`.`prices` AS prices ON items.id = prices.items_id""", engine)
table_i

      name type  price
0    Rifle  dry  100.0
1   Rocket  dry  300.0
2      Gun  dry  350.0
3    Laser  dry  400.0
4  Shotgun  wet  500.0

In [210]:
# вывести name, type из items и price из prices
# могут быть товары, у которых нет цены
table_i = pd.read_sql_query("""SELECT 
                                name
                                , type
                                , price 
                            FROM 
                                `goods_db`.`items` AS items
                            LEFT JOIN
                                `goods_db`.`prices` AS prices ON items.id = prices.items_id""", engine)
table_i

      name type  price
0    Rifle  dry  100.0
1   Rocket  dry  300.0
2      Gun  dry  350.0
3    Laser  dry  400.0
4  Shotgun  wet  500.0

In [211]:
# получить среднюю цену
table_p = pd.read_sql_query("""SELECT AVG(price) AS avg_price FROM `goods_db`.`prices`""", engine)
table_p

   avg_price
0      330.0

In [212]:
# получить id товаров и цену для товаров, у которых цена < средней цены
table_p = pd.read_sql_query("""SELECT
                                items_id,
                                price                     
                            FROM `goods_db`.`prices`
                            WHERE
                                price < (SELECT AVG(price) FROM `goods_db`.`prices`)""", engine)
table_p

   items_id  price
0         1  100.0
1         3  300.0